export const studentsValidCsvParseResultTestData = {
  data: [['מוטי', 'כהן', 'בן', 'דולב', 'מוטיכ', 'מכ123456'], ['נועה', 'לוין', 'בת', 'טיטאן', 'נועהלו', 'נלו123456']],
};

export const studentsInvalidCsvParseResultTestData = {
  data: [
    ['', 'כהן', 'בת', 'טיטאן', 'אלכסנדרה1', 'Aa123456'],
    ['אנדרי', '', 'בן', 'טיטאן', 'אנדרי', 'Aa123456'],
    ['אנדרי', 'לוי', 'מין לא קיים', 'טיטאן', 'אנדרי', 'Aa123456'],
    ['חיים', 'שפירא', 'בן', 'כיתה לא קיימת', 'חיים1', 'Aa123456'],
    ['מזל', 'בן-חיים', 'בת', 'טיטאן', 'קצר', 'Aa123456'],
    ['דוד', 'ויצמן', 'בן', 'טיטאן', 'דוד123', 'aaa'],
  ],
};

export const studentsInvalidCsvErrorsExpectation = {
  data: {
    title: 'קובץ לא תקין',
    details: [
      'שורה 1 - שם פרטי',
      'שורה 2 - שם משפחה',
      'שורה 3 - מין, שם משתמש',
      'שורה 4 - כיתה',
      'שורה 5 - שם משתמש',
      'שורה 6 - סיסמא',
    ],
    bottomline: 'אנא תקן את הקובץ ונסה שנית.',
  },
};
